## Seleção - Extra

In [29]:
import pandas as pd
import numpy as np

In [30]:
data = [(1, 2, 3, 4),
        (5, 6, 7, 8),
        (8, 10, 11, 12),
        (13, 14, 15, 16)]
df = pd.DataFrame(data, 'l1 l2 l3 l4'.split(), 'c1 c2 c3 c4'.split())

In [31]:
df

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [32]:
# selecionar as colunas de df: passaremos o rótulo c1
df['c1']

l1     1
l2     5
l3     8
l4    13
Name: c1, dtype: int64

In [33]:
type(df['c1'])

pandas.core.series.Series

In [34]:
#selecinando mais de uma coluna de nosso DataFrame
df[['c3', 'c1']]

    c3  c1
l1   3   1
l2   7   5
l3  11   8
l4  15  13

In [35]:
type(df[['c3', 'c1']])

pandas.core.frame.DataFrame

In [36]:
#seleção por linha
df[:]

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [37]:
#somente apartir de uma linha
df[1:]

    c1  c2  c3  c4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [38]:
#apos uma linha (de/para)
df[1: 3]

    c1  c2  c3  c4
l2   5   6   7   8
l3   8  10  11  12

In [39]:
#seleção para colunas
df[1:][['c3', 'c1']]

    c3  c1
l2   7   5
l3  11   8
l4  15  13

In [40]:
df

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [41]:
#loc - localizar valor em x linha
df.loc['l3']

c1     8
c2    10
c3    11
c4    12
Name: l3, dtype: int64

In [44]:
#loc - localizar valor em x linha e coluna
df.loc[['l3', 'l2']]

    c1  c2  c3  c4
l3   8  10  11  12
l2   5   6   7   8

In [47]:
df.loc['l1', 'c2']

2

In [50]:
#selecao por valores
df.iloc[0,1]

2

In [51]:
df

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [49]:
#grupos de selecao de linha e coluna
df.loc[['l3', 'l1'], ['c4', 'c1']]

    c4  c1
l3  12   8
l1   4   1

In [54]:
#grupos de selecao de linha e coluna por indices
df.iloc[[2,0],[3,0]]

    c4  c1
l3  12   8
l1   4   1